InformationRegisters/_РаботыЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_РаботыЗаДень</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасыКлиенту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗагруженоСRM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ВидыОбращенийТехподдержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСервисДеск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef._ИсполнениеЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/_СоответствиеСБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_СоответствиеСБух</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонтрагентБух</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорБух</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СводныйАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

HTTPServices/ПолучитьДанныеВыполненияЗаявок/Ext/Module.bsl
Функция ДанныеGet(Запрос)
    
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	Параметры =  ПрочитатьJSON(ЧтениеJSON, Ложь);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   СУММА(ВЫБОР
        |           КОГДА ВЫБОР
        |                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                       ТОГДА 0
        |                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |               КОНЕЦ * ВЫБОР
        |                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                       ТОГДА 1
        |                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |               КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                           ТОГДА 0
        |                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                   КОНЕЦ * ВЫБОР
        |                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                           ТОГДА 1
        |                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                   КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0
        |               ТОГДА ВЫБОР
        |                       КОГДА ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.25
        |                           ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                           ТОГДА 0
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                                   КОНЕЦ * ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                           ТОГДА 1
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                                   КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.25 - 1
        |                       КОГДА ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.5
        |                           ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                           ТОГДА 0
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                                   КОНЕЦ * ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                           ТОГДА 1
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                                   КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.5 - 1
        |                       КОГДА ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 1 <= 0.75
        |                           ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                           ТОГДА 0
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                                   КОНЕЦ * ВЫБОР
        |                                       КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                           ТОГДА 1
        |                                       ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                                   КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.75 - 1
        |                       ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))
        |                   КОНЕЦ
        |           ИНАЧЕ ВЫБОР
        |                   КОГДА ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                               ТОГДА 0
        |                           ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                       КОНЕЦ * ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                               ТОГДА 1
        |                           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                       КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.25
        |                       ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.25
        |                   КОГДА ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                               ТОГДА 0
        |                           ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                       КОНЕЦ * ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                               ТОГДА 1
        |                           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                       КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.5
        |                       ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.5
        |                   КОГДА ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                               ТОГДА 0
        |                           ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                       КОНЕЦ * ВЫБОР
        |                           КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                               ТОГДА 1
        |                           ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                       КОНЕЦ - (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) <= 0.75
        |                       ТОГДА (ВЫРАЗИТЬ(ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                       ТОГДА 0
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                               КОНЕЦ * ВЫБОР
        |                                   КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                       ТОГДА 1
        |                                   ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                               КОНЕЦ КАК ЧИСЛО(12, 0))) + 0.75
        |                   ИНАЧЕ (ВЫРАЗИТЬ(ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.ВыводитьВОтчетСогласованныеЧасы
        |                                   ТОГДА 0
        |                               ИНАЧЕ ЗаявкаЧекЛисты.ЧасыКлиенту
        |                           КОНЕЦ * ВЫБОР
        |                               КОГДА ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот = 0
        |                                   ТОГДА 1
        |                               ИНАЧЕ ЗаявкаЧекЛисты.Заявка.Контрагент.КоэффДляРасшифровкиРабот
        |                           КОНЕЦ КАК ЧИСЛО(12, 0))) + 1
        |               КОНЕЦ
        |       КОНЕЦ) КАК Часы1,
        |   ВЫБОР
        |       КОГДА ЕСТЬNULL(СоответствиеСБух.ДоговорБух, """") = """"
        |           ТОГДА ""Контрагент "" + ЗаявкаЧекЛисты.Заявка.Контрагент.Наименование + "" / "" + ЕСТЬNULL(ЗаявкаЧекЛисты.Заявка.Проект.Наименование, ""<без проекта>"")
        |       ИНАЧЕ СоответствиеСБух.ДоговорБух
        |   КОНЕЦ КАК ДоговорБух,
        |   НАЧАЛОПЕРИОДА(ВЫБОР
        |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
        |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта
        |           ИНАЧЕ ЗаявкаЧекЛисты.Дата
        |       КОНЕЦ, МЕСЯЦ) КАК Период,
        |   ЗаявкаЧекЛисты.Заявка.Контрагент КАК Контрагент,
        |   СоответствиеСБух.КонтрагентБух КАК КонтрагентБух,
        |   СУММА(ЗаявкаЧекЛисты.ЧасыКлиенту) КАК Часы
        |ИЗ
        |   регистрсведений._РаботыЗаДень КАК ЗаявкаЧекЛисты
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._СоответствиеСБух КАК СоответствиеСБух
        |       ПО ЗаявкаЧекЛисты.Заявка.Контрагент = СоответствиеСБух.Контрагент
        |           И ЗаявкаЧекЛисты.Заявка.Проект = СоответствиеСБух.Проект
        |ГДЕ
        |   ВЫБОР
        |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
        |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта МЕЖДУ &Дата1 И &Дата2
        |           ИНАЧЕ ЗаявкаЧекЛисты.Дата МЕЖДУ &Дата1 И &Дата2
        |                   И ЗаявкаЧекЛисты.Заявка.Техподдержка
        |       КОНЕЦ
        |   И ЗаявкаЧекЛисты.ЧасыКлиенту <> 0
        |
        |СГРУППИРОВАТЬ ПО
        |   НАЧАЛОПЕРИОДА(ВЫБОР
        |           КОГДА НЕ ЗаявкаЧекЛисты.Заявка.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
        |               ТОГДА ЗаявкаЧекЛисты.Заявка.ДатаАкта
        |           ИНАЧЕ ЗаявкаЧекЛисты.Дата
        |       КОНЕЦ, МЕСЯЦ),
        |   ВЫБОР
        |       КОГДА ЕСТЬNULL(СоответствиеСБух.ДоговорБух, """") = """"
        |           ТОГДА ""Контрагент "" + ЗаявкаЧекЛисты.Заявка.Контрагент.Наименование + "" / "" + ЕСТЬNULL(ЗаявкаЧекЛисты.Заявка.Проект.Наименование, ""<без проекта>"")
        |       ИНАЧЕ СоответствиеСБух.ДоговорБух
        |   КОНЕЦ,
        |   ЗаявкаЧекЛисты.Заявка.Контрагент,
        |   СоответствиеСБух.КонтрагентБух";
    
    Запрос.УстановитьПараметр("Дата1", Дата(Параметры.Дата1));
    Запрос.УстановитьПараметр("Дата2", Дата(Параметры.Дата2));
    
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
    
    Ответ = Новый HTTPСервисОтвет(200);
		
		МассивДанных = новый Массив ;
		
		Пока РезультатЗапроса.Следующий() Цикл
            
            Данные = РезультатЗапроса;
            
            ГЛСтруктура = новый Структура;
			ГЛСтруктура.Вставить("ДоговорБух",     строка(Данные.ДоговорБух)); 
			ГЛСтруктура.Вставить("Часы",           строка(Данные.Часы)); 
			ГЛСтруктура.Вставить("Период",           строка(Данные.Период)); 
			
			МассивДанных.Добавить(ГЛСтруктура)
		КонецЦикла;
		
		СтруктураВозврата = новый Структура("entities",МассивДанных) ;
		
		СтрокаВозврата = Сериализовать(СтруктураВозврата);
		
		Ответ.УстановитьТелоИзСтроки(СтрокаВозврата);
		Возврат Ответ;
    Возврат Ответ;
КонецФункции

Функция Сериализовать(Объект) 
	
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", Истина);
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Объект);
	Возврат Запись.Закрыть();
	
КонецФункции
